===
Type definition - refinement
===

module Test
  type Port is Integer where 1..65535

---

(source_file
  (module_declaration
    (type_identifier)
    (type_definition
      (type_identifier)
      (refinement_type_body
        (type_expression (simple_type (type_identifier)))
        (expression
          (binary_expression
            (expression (integer_literal))
            (expression (integer_literal))))))))

===
Type definition - algebraic
===

module Test
  type Route is Get(path String) | Post(path String)

---

(source_file
  (module_declaration
    (type_identifier)
    (type_definition
      (type_identifier)
      (algebraic_type_body
        (algebraic_variant
          (type_identifier)
          (variant_fields (field_declaration (identifier) (type_expression (simple_type (type_identifier))))))
        (algebraic_variant
          (type_identifier)
          (variant_fields (field_declaration (identifier) (type_expression (simple_type (type_identifier))))))))))

===
Validates function
===

validates email(address String)
    from
        contains(address, "@")

---

(source_file
  (function_definition
    (verb)
    (identifier)
    (parameter_list
      (parameter (identifier) (type_expression (simple_type (type_identifier)))))
    (expression
      (call_expression
        (identifier)
        (expression (identifier))
        (expression (string_literal))))))

===
Inputs function with return type
===

inputs users(db Database) List<User>
    from
        query(db, "SELECT * FROM users")

---

(source_file
  (function_definition
    (verb)
    (identifier)
    (parameter_list
      (parameter (identifier) (type_expression (simple_type (type_identifier)))))
    (type_expression
      (generic_type (type_identifier) (type_expression (simple_type (type_identifier)))))
    (expression
      (call_expression
        (identifier)
        (expression (identifier))
        (expression (string_literal))))))

===
Main definition
===

main() Result
    from
        listen(server, 8080)

---

(source_file
  (main_definition
    (type_expression (simple_type (type_identifier)))
    (expression
      (call_expression
        (identifier)
        (expression (identifier))
        (expression (integer_literal))))))

===
Pure verb - reads
===

reads config(path String) String
    from
        load(path)

---

(source_file
  (function_definition
    (verb)
    (identifier)
    (parameter_list
      (parameter (identifier) (type_expression (simple_type (type_identifier)))))
    (type_expression (simple_type (type_identifier)))
    (expression
      (call_expression
        (identifier)
        (expression (identifier))))))

===
Pure verb - creates
===

creates user(name String) User
    from
        User(name)

---

(source_file
  (function_definition
    (verb)
    (identifier)
    (parameter_list
      (parameter (identifier) (type_expression (simple_type (type_identifier)))))
    (type_expression (simple_type (type_identifier)))
    (expression
      (call_expression
        (type_identifier)
        (expression (identifier))))))

===
Binary type definition
===

module Test
  type Handle is binary

---

(source_file
  (module_declaration
    (type_identifier)
    (type_definition
      (type_identifier)
      (binary_type_body))))

===
Namespaced function call
===

transforms greet(name String) String
    from
        Strings.concat("Hello, ", name)

---

(source_file
  (function_definition
    (verb)
    (identifier)
    (parameter_list
      (parameter (identifier) (type_expression (simple_type (type_identifier)))))
    (type_expression (simple_type (type_identifier)))
    (expression
      (call_expression
        (field_expression
          (expression (type_identifier))
          (identifier))
        (expression (string_literal))
        (expression (identifier))))))

===
Import with types keyword
===

module Foo
  Http types Response Server, inputs listen

---

(source_file
  (module_declaration
    (type_identifier)
    (import_declaration
      (type_identifier)
      (import_group
        (type_identifier)
        (type_identifier))
      (import_group
        (verb)
        (identifier)))))
